---
kind: property
id: P:Autodesk.Revit.DB.Family.CurtainPanelTilePattern
zh: 族
source: html/7f206977-92a7-b92d-98e6-8b314c742bc8.htm
---
# Autodesk.Revit.DB.Family.CurtainPanelTilePattern Property

**中文**: 族

For Curtain Panel families, the choice of tile pattern.

## Syntax (C#)
```csharp
public TilePatternsBuiltIn CurtainPanelTilePattern { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown if this family is not a Curtain Panel family.